app/views/collections/_form.html.erb

SELECT "movies".* FROM "movies" ORDER BY title
---
          <div class="row">
            <% Movie.order(:title).each do |movie| %>

SELECT "movies".* FROM "movies" WHERE "movies"."collection_id" = 6
---
              <div class="panel">
                <h5><%= check_box_tag 'collection[movie_ids][]', movie.id, movie.in?(@collection.movies.to_a) %><%= movie.title %></h5>