app/views/collections/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."collection_id" = 13
---
<ul>
  <% @collection.movies.each do |movie| %>