app/views/actors/_form.html.erb

SELECT "movies".id FROM "movies" INNER JOIN "actors_movies" ON "movies"."id" = "actors_movies"."movie_id" WHERE "actors_movies"."actor_id" IS NULL
---
  <%= f.label :movie_id, "Select :  " %>
  <%= f.select :movie_ids, Movie.all.map{|movie| [movie.title, movie.id]}, :include_blank => true, :prompt => "Movie Title" %>