app/views/movies/_form.html.erb

  <%= f.label :collection_id, "Select :  " %>
  <%= f.select :collection_id, Collection.all.map{|collection| [collection.name, collection.id]}, :include_blank => true, :prompt => "Reelz Name" %>
---
SELECT "collections".* FROM "collections"

<br>
<% Actor.order(:name).each do |actor| %>
---
SELECT "actors".* FROM "actors" ORDER BY name