app/views/movies/show.html.erb

SELECT "actors".* FROM "actors" INNER JOIN "actors_movies" ON "actors"."id" = "actors_movies"."actor_id" WHERE "actors_movies"."movie_id" = 6
---
<ul>
<% @movie.actors.each do |actor| %>