app/controllers/actors_controller.rb

  def create
    actor = Actor.create(params[:actor])
---
INSERT INTO "actors" ("birthplace", "created_at", "dob", "dod", "image", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birthplace", "a"], ["created_at", Sun, 17 Feb 2013 20:42:59 UTC +00:00], ["dob", nil], ["dod", nil], ["image", "a"], ["name", "a"], ["updated_at", Sun, 17 Feb 2013 20:42:59 UTC +00:00]]

  def show
    @actor = Actor.find(params[:id])
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT 1  [["id", "11"]]

  def edit
    @actor = Actor.find(params[:id])
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT 1  [["id", "12"]]

  def update
    actor = Actor.find(params[:id])
    actor.update_attributes(params[:actor])
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT 1  [["id", "12"]]
UPDATE "actors" SET "dob" = '2012-02-01', "dod" = '2013-02-10', "updated_at" = '2013-02-17 20:45:00.171135' WHERE "actors"."id" = 12

  def destroy
    actor = Actor.find(params[:id])
    actor.delete
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = $1 LIMIT 1  [["id", "12"]]
DELETE FROM "actors" WHERE "actors"."id" = 12