app/controllers/collections_controller.rb

SELECT "collections".* FROM "collections"
---
  def index
    @collections = Collection.all

INSERT INTO "collections" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 17 Feb 2013 20:05:33 UTC +00:00], ["description", "this is the thrid one"], ["name", "test 2"], ["updated_at", Sun, 17 Feb 2013 20:05:33 UTC +00:00]]
---
  def create
    collection = Collection.create(params[:collection])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "index"]]
---
  def show
    @collection = Collection.find(params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "6"]]
---
  def edit
    @collection = Collection.find(params[:id])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "collections" SET "name" = 'Test One', "updated_at" = '2013-02-17 20:36:09.773302' WHERE "collections"."id" = 3
---
  def update
    collection = Collection.find(params[:id])
    collection.update_attributes(params[:collection])

SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "collections" WHERE "collections"."id" = 5
---
  def destroy
    collection = Collection.find(params[:id])
    collection.delete