app/controllers/movies_controller.rb

  def create
    movie = Movie.create(params[:movie])
---
INSERT INTO "movies" ("collection_id", "created_at", "director", "imdbID", "plot", "poster", "rated", "released", "runtime", "title", "updated_at", "year") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def destroy
    movie = Movie.find(params[:id])
    movie.delete
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", "7"]]
DELETE FROM "movies" WHERE "movies"."id" = 8